tap "microsoft/mssql-release"
brew "btop"
brew "direnv"
brew "fastfetch"
brew "fnm"
brew "fzf"
brew "gh"
brew "go"
brew "htop"
brew "just"
brew "pango"
brew "pnpm"
brew "unixodbc"
brew "uv"
brew "zoxide"
brew "microsoft/mssql-release/msodbcsql18"
cask "1password"
cask "1password-cli"
cask "alcove"
cask "claude"
cask "codex"
cask "ghostty"
cask "github"
cask "helium-browser"
cask "hiddenbar"
cask "hyperkey"
cask "iina"
cask "linearmouse"
cask "logi-options+" # pkg installer, needs sudo at install time
cask "macsyzones"
cask "marked-app"
cask "microsoft-edge"
cask "microsoft-teams" # pkg installer, needs sudo at install time
cask "orbstack"
cask "orcaslicer"
cask "orion"
cask "raycast"
cask "shottr"
cask "spotify"
cask "steam"
cask "t3-code"
cask "tailscale-app"
cask "unifi-identity-endpoint"
cask "visual-studio-code"
cask "zen"
vscode "1password.op-vscode"
vscode "angelo-breuer.clock"
vscode "antfu.browse-lite"
vscode "antfu.vite"
vscode "astral-sh.ty"
vscode "austenc.tailwind-docs"
vscode "batisteo.vscode-django"
vscode "bourhaouta.tailwindshades"
vscode "bradlc.vscode-tailwindcss"
vscode "chanhx.crabviz"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "ckolkman.vscode-postgres"
vscode "damildrizzy.fastapi-snippets"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "franken-ui.nette-for-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "hosana.custom-status-bar"
vscode "hyunkyunmoon.gzipdecompressor"
vscode "iancooper.code-zpl"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "irongeek.vscode-env"
vscode "jock.svg"
vscode "kamilturek.vscode-zpl-viewer"
vscode "kevinrose.vsc-python-indent"
vscode "mariusschulz.yarn-lock-syntax"
vscode "mechatroner.rainbow-csv"
vscode "mjmlio.vscode-mjml"
vscode "monosans.djlint"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mssql"
vscode "njpwerner.autodocstring"
vscode "noxiz.jinja-snippets"
vscode "otovo-oss.htmx-tags"
vscode "plotlydashsnippets.plotly-dash-snippets"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "shopify.theme-check-vscode"
vscode "sidthesloth.html5-boilerplate"
vscode "sissel.shopify-liquid"
vscode "stivo.tailwind-fold"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "zarifprogrammer.tailwind-snippets"
vscode "zentch.depviz"
vscode "zeshuaro.vscode-python-poetry"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
go "github.com/air-verse/air"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
npm "corepack"
